ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/ICSSM_ICSSM_PR1_ICSS_INTC_INTC_SLV_48020000h.xml
<module name="ICSSM_pr1_icss_intc_intc_slv" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_REVISION_REG" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_REVISION_REG" offset="0" width="32" description="">
		<bitfield id="REV_SCHEME" width="2" begin="31" end="30" resetval="0x1" description=" Scheme" range="31:30" rwaccess="R"/>
	<bitfield id="REV_MODULE" width="12" begin="27" end="16" resetval="0x3714" description=" Module ID" range="27:16" rwaccess="R"/>
	<bitfield id="REV_RTL" width="5" begin="15" end="11" resetval="0x21" description=" RTL revisions" range="15:11" rwaccess="R"/>
	<bitfield id="REV_MAJOR" width="3" begin="10" end="8" resetval="0x1" description=" Major revision" range="10:8" rwaccess="R"/>
	<bitfield id="REV_CUSTOM" width="2" begin="7" end="6" resetval="0x0" description=" Custom revision" range="7:6" rwaccess="R"/>
	<bitfield id="REV_MINOR" width="6" begin="5" end="0" resetval="0x0" description=" Minor revision" range="5:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_CONTROL_REG" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_CONTROL_REG" offset="4" width="32" description="">
		<bitfield id="PRIORITY_HOLD_MODE" width="1" begin="4" end="4" resetval="0x0" description=" Priority Holding Mode" range="4" rwaccess="R/W"/>
	<bitfield id="NEST_MODE" width="2" begin="3" end="2" resetval="0x0" description=" Nesting Mode" range="3:2" rwaccess="R/W"/>
	<bitfield id="WAKEUP_MODE" width="1" begin="1" end="1" resetval="0x0" description=" Wakeup mode enable" range="1" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_GLOBAL_ENABLE_HINT_REG" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_GLOBAL_ENABLE_HINT_REG" offset="16" width="32" description="">
		<bitfield id="ENABLE_HINT_ANY" width="1" begin="0" end="0" resetval="0x0" description=" Global Enable for all Host Ints" range="0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_GLB_NEST_LEVEL_REG" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_GLB_NEST_LEVEL_REG" offset="28" width="32" description="">
		<bitfield id="GLB_NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Global Nesting Level Override Automatic" range="31" rwaccess="W"/>
	<bitfield id="GLB_NEST_LEVEL" width="9" begin="8" end="0" resetval="0x256" description=" Global Nesting Level" range="8:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_STATUS_SET_INDEX_REG" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_STATUS_SET_INDEX_REG" offset="32" width="32" description="">
		<bitfield id="STATUS_SET_INDEX" width="10" begin="9" end="0" resetval="0x0" description=" Status Set Index Register (write index to set status of)" range="9:0" rwaccess="W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_STATUS_CLR_INDEX_REG" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_STATUS_CLR_INDEX_REG" offset="36" width="32" description="">
		<bitfield id="STATUS_CLR_INDEX" width="10" begin="9" end="0" resetval="0x0" description=" Status Clear Index Register (write index to clear status of)" range="9:0" rwaccess="W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_ENABLE_SET_INDEX_REG" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_ENABLE_SET_INDEX_REG" offset="40" width="32" description="">
		<bitfield id="ENABLE_SET_INDEX" width="10" begin="9" end="0" resetval="0x0" description=" Enable Set Index Register (write index to set enable of)" range="9:0" rwaccess="W1TS"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_ENABLE_CLR_INDEX_REG" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_ENABLE_CLR_INDEX_REG" offset="44" width="32" description="">
		<bitfield id="ENABLE_CLR_INDEX" width="10" begin="9" end="0" resetval="0x0" description=" Enable Clear Index Register (write index to clear enable of)" range="9:0" rwaccess="W1TC"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_HINT_ENABLE_SET_INDEX_REG" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_HINT_ENABLE_SET_INDEX_REG" offset="52" width="32" description="">
		<bitfield id="HINT_ENABLE_SET_INDEX" width="10" begin="9" end="0" resetval="0x0" description=" Enable set for Host Interrupts" range="9:0" rwaccess="W1TS"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_HINT_ENABLE_CLR_INDEX_REG" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_HINT_ENABLE_CLR_INDEX_REG" offset="56" width="32" description="">
		<bitfield id="HINT_ENABLE_CLR_INDEX" width="10" begin="9" end="0" resetval="0x0" description=" Enable clear for Host Interrupts" range="9:0" rwaccess="W1TC"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_GLB_PRI_INTR_REG" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_GLB_PRI_INTR_REG" offset="128" width="32" description="">
		<bitfield id="GLB_NONE" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/>
	<bitfield id="GLB_PRI_INTR" width="10" begin="9" end="0" resetval="0x0" description=" Prioritized Interrupt" range="9:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_RAW_STATUS_REG0" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_RAW_STATUS_REG0" offset="512" width="32" description="">
		<bitfield id="RAW_STATUS_31" width="1" begin="31" end="31" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[31]" range="31" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_30" width="1" begin="30" end="30" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[30]" range="30" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_29" width="1" begin="29" end="29" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[29]" range="29" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_28" width="1" begin="28" end="28" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[28]" range="28" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_27" width="1" begin="27" end="27" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[27]" range="27" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_26" width="1" begin="26" end="26" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[26]" range="26" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_25" width="1" begin="25" end="25" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[25]" range="25" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_24" width="1" begin="24" end="24" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[24]" range="24" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_23" width="1" begin="23" end="23" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[23]" range="23" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_22" width="1" begin="22" end="22" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[22]" range="22" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_21" width="1" begin="21" end="21" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[21]" range="21" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_20" width="1" begin="20" end="20" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[20]" range="20" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_19" width="1" begin="19" end="19" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[19]" range="19" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_18" width="1" begin="18" end="18" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[18]" range="18" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_17" width="1" begin="17" end="17" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[17]" range="17" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_16" width="1" begin="16" end="16" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[16]" range="16" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_15" width="1" begin="15" end="15" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[15]" range="15" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_14" width="1" begin="14" end="14" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[14]" range="14" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_13" width="1" begin="13" end="13" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[13]" range="13" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_12" width="1" begin="12" end="12" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[12]" range="12" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_11" width="1" begin="11" end="11" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[11]" range="11" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_10" width="1" begin="10" end="10" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[10]" range="10" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_9" width="1" begin="9" end="9" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[9]" range="9" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_8" width="1" begin="8" end="8" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[8]" range="8" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_7" width="1" begin="7" end="7" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[7]" range="7" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_6" width="1" begin="6" end="6" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[6]" range="6" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_5" width="1" begin="5" end="5" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[5]" range="5" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_4" width="1" begin="4" end="4" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[4]" range="4" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_3" width="1" begin="3" end="3" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[3]" range="3" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_2" width="1" begin="2" end="2" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[2]" range="2" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_1" width="1" begin="1" end="1" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[1]" range="1" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_0" width="1" begin="0" end="0" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[0]" range="0" rwaccess="W1TS"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_RAW_STATUS_REG1" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_RAW_STATUS_REG1" offset="516" width="32" description="">
		<bitfield id="RAW_STATUS_63" width="1" begin="31" end="31" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[63]" range="31" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_62" width="1" begin="30" end="30" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[62]" range="30" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_61" width="1" begin="29" end="29" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[61]" range="29" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_60" width="1" begin="28" end="28" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[60]" range="28" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_59" width="1" begin="27" end="27" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[59]" range="27" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_58" width="1" begin="26" end="26" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[58]" range="26" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_57" width="1" begin="25" end="25" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[57]" range="25" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_56" width="1" begin="24" end="24" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[56]" range="24" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_55" width="1" begin="23" end="23" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[55]" range="23" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_54" width="1" begin="22" end="22" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[54]" range="22" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_53" width="1" begin="21" end="21" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[53]" range="21" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_52" width="1" begin="20" end="20" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[52]" range="20" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_51" width="1" begin="19" end="19" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[51]" range="19" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_50" width="1" begin="18" end="18" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[50]" range="18" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_49" width="1" begin="17" end="17" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[49]" range="17" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_48" width="1" begin="16" end="16" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[48]" range="16" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_47" width="1" begin="15" end="15" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[47]" range="15" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_46" width="1" begin="14" end="14" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[46]" range="14" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_45" width="1" begin="13" end="13" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[45]" range="13" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_44" width="1" begin="12" end="12" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[44]" range="12" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_43" width="1" begin="11" end="11" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[43]" range="11" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_42" width="1" begin="10" end="10" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[42]" range="10" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_41" width="1" begin="9" end="9" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[41]" range="9" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_40" width="1" begin="8" end="8" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[40]" range="8" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_39" width="1" begin="7" end="7" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[39]" range="7" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_38" width="1" begin="6" end="6" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[38]" range="6" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_37" width="1" begin="5" end="5" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[37]" range="5" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_36" width="1" begin="4" end="4" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[36]" range="4" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_35" width="1" begin="3" end="3" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[35]" range="3" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_34" width="1" begin="2" end="2" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[34]" range="2" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_33" width="1" begin="1" end="1" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[33]" range="1" rwaccess="W1TS"/>
	<bitfield id="RAW_STATUS_32" width="1" begin="0" end="0" resetval="0x0" description=" Raw Status (write 1 to set) for intr_in[32]" range="0" rwaccess="W1TS"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_ENA_STATUS_REG0" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_ENA_STATUS_REG0" offset="640" width="32" description="">
		<bitfield id="ENA_STATUS_31" width="1" begin="31" end="31" resetval="0x0" description=" Enabled Status for intr_in[31]" range="31" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_30" width="1" begin="30" end="30" resetval="0x0" description=" Enabled Status for intr_in[30]" range="30" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_29" width="1" begin="29" end="29" resetval="0x0" description=" Enabled Status for intr_in[29]" range="29" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_28" width="1" begin="28" end="28" resetval="0x0" description=" Enabled Status for intr_in[28]" range="28" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_27" width="1" begin="27" end="27" resetval="0x0" description=" Enabled Status for intr_in[27]" range="27" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_26" width="1" begin="26" end="26" resetval="0x0" description=" Enabled Status for intr_in[26]" range="26" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_25" width="1" begin="25" end="25" resetval="0x0" description=" Enabled Status for intr_in[25]" range="25" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_24" width="1" begin="24" end="24" resetval="0x0" description=" Enabled Status for intr_in[24]" range="24" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_23" width="1" begin="23" end="23" resetval="0x0" description=" Enabled Status for intr_in[23]" range="23" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_22" width="1" begin="22" end="22" resetval="0x0" description=" Enabled Status for intr_in[22]" range="22" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_21" width="1" begin="21" end="21" resetval="0x0" description=" Enabled Status for intr_in[21]" range="21" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_20" width="1" begin="20" end="20" resetval="0x0" description=" Enabled Status for intr_in[20]" range="20" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_19" width="1" begin="19" end="19" resetval="0x0" description=" Enabled Status for intr_in[19]" range="19" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_18" width="1" begin="18" end="18" resetval="0x0" description=" Enabled Status for intr_in[18]" range="18" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_17" width="1" begin="17" end="17" resetval="0x0" description=" Enabled Status for intr_in[17]" range="17" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_16" width="1" begin="16" end="16" resetval="0x0" description=" Enabled Status for intr_in[16]" range="16" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_15" width="1" begin="15" end="15" resetval="0x0" description=" Enabled Status for intr_in[15]" range="15" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_14" width="1" begin="14" end="14" resetval="0x0" description=" Enabled Status for intr_in[14]" range="14" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_13" width="1" begin="13" end="13" resetval="0x0" description=" Enabled Status for intr_in[13]" range="13" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_12" width="1" begin="12" end="12" resetval="0x0" description=" Enabled Status for intr_in[12]" range="12" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_11" width="1" begin="11" end="11" resetval="0x0" description=" Enabled Status for intr_in[11]" range="11" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_10" width="1" begin="10" end="10" resetval="0x0" description=" Enabled Status for intr_in[10]" range="10" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_9" width="1" begin="9" end="9" resetval="0x0" description=" Enabled Status for intr_in[9]" range="9" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_8" width="1" begin="8" end="8" resetval="0x0" description=" Enabled Status for intr_in[8]" range="8" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_7" width="1" begin="7" end="7" resetval="0x0" description=" Enabled Status for intr_in[7]" range="7" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_6" width="1" begin="6" end="6" resetval="0x0" description=" Enabled Status for intr_in[6]" range="6" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_5" width="1" begin="5" end="5" resetval="0x0" description=" Enabled Status for intr_in[5]" range="5" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_4" width="1" begin="4" end="4" resetval="0x0" description=" Enabled Status for intr_in[4]" range="4" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_3" width="1" begin="3" end="3" resetval="0x0" description=" Enabled Status for intr_in[3]" range="3" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_2" width="1" begin="2" end="2" resetval="0x0" description=" Enabled Status for intr_in[2]" range="2" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_1" width="1" begin="1" end="1" resetval="0x0" description=" Enabled Status for intr_in[1]" range="1" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_0" width="1" begin="0" end="0" resetval="0x0" description=" Enabled Status for intr_in[0]" range="0" rwaccess="W1TC"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_ENA_STATUS_REG1" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_ENA_STATUS_REG1" offset="644" width="32" description="">
		<bitfield id="ENA_STATUS_63" width="1" begin="31" end="31" resetval="0x0" description=" Enabled Status for intr_in[63]" range="31" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_62" width="1" begin="30" end="30" resetval="0x0" description=" Enabled Status for intr_in[62]" range="30" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_61" width="1" begin="29" end="29" resetval="0x0" description=" Enabled Status for intr_in[61]" range="29" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_60" width="1" begin="28" end="28" resetval="0x0" description=" Enabled Status for intr_in[60]" range="28" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_59" width="1" begin="27" end="27" resetval="0x0" description=" Enabled Status for intr_in[59]" range="27" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_58" width="1" begin="26" end="26" resetval="0x0" description=" Enabled Status for intr_in[58]" range="26" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_57" width="1" begin="25" end="25" resetval="0x0" description=" Enabled Status for intr_in[57]" range="25" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_56" width="1" begin="24" end="24" resetval="0x0" description=" Enabled Status for intr_in[56]" range="24" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_55" width="1" begin="23" end="23" resetval="0x0" description=" Enabled Status for intr_in[55]" range="23" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_54" width="1" begin="22" end="22" resetval="0x0" description=" Enabled Status for intr_in[54]" range="22" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_53" width="1" begin="21" end="21" resetval="0x0" description=" Enabled Status for intr_in[53]" range="21" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_52" width="1" begin="20" end="20" resetval="0x0" description=" Enabled Status for intr_in[52]" range="20" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_51" width="1" begin="19" end="19" resetval="0x0" description=" Enabled Status for intr_in[51]" range="19" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_50" width="1" begin="18" end="18" resetval="0x0" description=" Enabled Status for intr_in[50]" range="18" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_49" width="1" begin="17" end="17" resetval="0x0" description=" Enabled Status for intr_in[49]" range="17" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_48" width="1" begin="16" end="16" resetval="0x0" description=" Enabled Status for intr_in[48]" range="16" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_47" width="1" begin="15" end="15" resetval="0x0" description=" Enabled Status for intr_in[47]" range="15" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_46" width="1" begin="14" end="14" resetval="0x0" description=" Enabled Status for intr_in[46]" range="14" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_45" width="1" begin="13" end="13" resetval="0x0" description=" Enabled Status for intr_in[45]" range="13" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_44" width="1" begin="12" end="12" resetval="0x0" description=" Enabled Status for intr_in[44]" range="12" rwaccess="W1TC"/>
	<bitfield id="ENA_STATUS_43" width="1" begin="11" end="11" resetval="0x0" description=" Enabled Status for intr_in[43]" range="11" rwaccess="W1TC"/>
