ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/ICSSM_ICSSM_PR1_ICSS_INTC_INTC_SLV_48020000h.xml
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG4" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG4" offset="1040" width="32" description="">
		<bitfield id="CH_MAP_19" width="4" begin="27" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[19]" range="27:24" rwaccess="R/W"/>
	<bitfield id="CH_MAP_18" width="4" begin="19" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[18]" range="19:16" rwaccess="R/W"/>
	<bitfield id="CH_MAP_17" width="4" begin="11" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[17]" range="11:8" rwaccess="R/W"/>
	<bitfield id="CH_MAP_16" width="4" begin="3" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[16]" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG5" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG5" offset="1044" width="32" description="">
		<bitfield id="CH_MAP_23" width="4" begin="27" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[23]" range="27:24" rwaccess="R/W"/>
	<bitfield id="CH_MAP_22" width="4" begin="19" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[22]" range="19:16" rwaccess="R/W"/>
	<bitfield id="CH_MAP_21" width="4" begin="11" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[21]" range="11:8" rwaccess="R/W"/>
	<bitfield id="CH_MAP_20" width="4" begin="3" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[20]" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG6" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG6" offset="1048" width="32" description="">
		<bitfield id="CH_MAP_27" width="4" begin="27" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[27]" range="27:24" rwaccess="R/W"/>
	<bitfield id="CH_MAP_26" width="4" begin="19" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[26]" range="19:16" rwaccess="R/W"/>
	<bitfield id="CH_MAP_25" width="4" begin="11" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[25]" range="11:8" rwaccess="R/W"/>
	<bitfield id="CH_MAP_24" width="4" begin="3" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[24]" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG7" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG7" offset="1052" width="32" description="">
		<bitfield id="CH_MAP_31" width="4" begin="27" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[31]" range="27:24" rwaccess="R/W"/>
	<bitfield id="CH_MAP_30" width="4" begin="19" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[30]" range="19:16" rwaccess="R/W"/>
	<bitfield id="CH_MAP_29" width="4" begin="11" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[29]" range="11:8" rwaccess="R/W"/>
	<bitfield id="CH_MAP_28" width="4" begin="3" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[28]" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG8" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG8" offset="1056" width="32" description="">
		<bitfield id="CH_MAP_35" width="4" begin="27" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[35]" range="27:24" rwaccess="R/W"/>
	<bitfield id="CH_MAP_34" width="4" begin="19" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[34]" range="19:16" rwaccess="R/W"/>
	<bitfield id="CH_MAP_33" width="4" begin="11" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[33]" range="11:8" rwaccess="R/W"/>
	<bitfield id="CH_MAP_32" width="4" begin="3" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[32]" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG9" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG9" offset="1060" width="32" description="">
		<bitfield id="CH_MAP_39" width="4" begin="27" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[39]" range="27:24" rwaccess="R/W"/>
	<bitfield id="CH_MAP_38" width="4" begin="19" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[38]" range="19:16" rwaccess="R/W"/>
	<bitfield id="CH_MAP_37" width="4" begin="11" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[37]" range="11:8" rwaccess="R/W"/>
	<bitfield id="CH_MAP_36" width="4" begin="3" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[36]" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG10" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG10" offset="1064" width="32" description="">
		<bitfield id="CH_MAP_43" width="4" begin="27" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[43]" range="27:24" rwaccess="R/W"/>
	<bitfield id="CH_MAP_42" width="4" begin="19" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[42]" range="19:16" rwaccess="R/W"/>
	<bitfield id="CH_MAP_41" width="4" begin="11" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[41]" range="11:8" rwaccess="R/W"/>
	<bitfield id="CH_MAP_40" width="4" begin="3" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[40]" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG11" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG11" offset="1068" width="32" description="">
		<bitfield id="CH_MAP_47" width="4" begin="27" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[47]" range="27:24" rwaccess="R/W"/>
	<bitfield id="CH_MAP_46" width="4" begin="19" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[46]" range="19:16" rwaccess="R/W"/>
	<bitfield id="CH_MAP_45" width="4" begin="11" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[45]" range="11:8" rwaccess="R/W"/>
	<bitfield id="CH_MAP_44" width="4" begin="3" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[44]" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG12" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG12" offset="1072" width="32" description="">
		<bitfield id="CH_MAP_51" width="4" begin="27" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[51]" range="27:24" rwaccess="R/W"/>
	<bitfield id="CH_MAP_50" width="4" begin="19" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[50]" range="19:16" rwaccess="R/W"/>
	<bitfield id="CH_MAP_49" width="4" begin="11" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[49]" range="11:8" rwaccess="R/W"/>
	<bitfield id="CH_MAP_48" width="4" begin="3" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[48]" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG13" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG13" offset="1076" width="32" description="">
		<bitfield id="CH_MAP_55" width="4" begin="27" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[55]" range="27:24" rwaccess="R/W"/>
	<bitfield id="CH_MAP_54" width="4" begin="19" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[54]" range="19:16" rwaccess="R/W"/>
	<bitfield id="CH_MAP_53" width="4" begin="11" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[53]" range="11:8" rwaccess="R/W"/>
	<bitfield id="CH_MAP_52" width="4" begin="3" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[52]" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG14" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG14" offset="1080" width="32" description="">
		<bitfield id="CH_MAP_59" width="4" begin="27" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[59]" range="27:24" rwaccess="R/W"/>
	<bitfield id="CH_MAP_58" width="4" begin="19" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[58]" range="19:16" rwaccess="R/W"/>
	<bitfield id="CH_MAP_57" width="4" begin="11" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[57]" range="11:8" rwaccess="R/W"/>
	<bitfield id="CH_MAP_56" width="4" begin="3" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[56]" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG15" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_CH_MAP_REG15" offset="1084" width="32" description="">
		<bitfield id="CH_MAP_63" width="4" begin="27" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[63]" range="27:24" rwaccess="R/W"/>
	<bitfield id="CH_MAP_62" width="4" begin="19" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[62]" range="19:16" rwaccess="R/W"/>
	<bitfield id="CH_MAP_61" width="4" begin="11" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[61]" range="11:8" rwaccess="R/W"/>
	<bitfield id="CH_MAP_60" width="4" begin="3" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[60]" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_HINT_MAP_REG0" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_HINT_MAP_REG0" offset="2048" width="32" description="">
		<bitfield id="HINT_MAP_3" width="4" begin="27" end="24" resetval="0x0" description=" Host Interrupt Map for Channel 3" range="27:24" rwaccess="R/W"/>
	<bitfield id="HINT_MAP_2" width="4" begin="19" end="16" resetval="0x0" description=" Host Interrupt Map for Channel 2" range="19:16" rwaccess="R/W"/>
	<bitfield id="HINT_MAP_1" width="4" begin="11" end="8" resetval="0x0" description=" Host Interrupt Map for Channel 1" range="11:8" rwaccess="R/W"/>
	<bitfield id="HINT_MAP_0" width="4" begin="3" end="0" resetval="0x0" description=" Host Interrupt Map for Channel 0" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_HINT_MAP_REG1" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_HINT_MAP_REG1" offset="2052" width="32" description="">
		<bitfield id="HINT_MAP_7" width="4" begin="27" end="24" resetval="0x0" description=" Host Interrupt Map for Channel 7" range="27:24" rwaccess="R/W"/>
	<bitfield id="HINT_MAP_6" width="4" begin="19" end="16" resetval="0x0" description=" Host Interrupt Map for Channel 6" range="19:16" rwaccess="R/W"/>
	<bitfield id="HINT_MAP_5" width="4" begin="11" end="8" resetval="0x0" description=" Host Interrupt Map for Channel 5" range="11:8" rwaccess="R/W"/>
	<bitfield id="HINT_MAP_4" width="4" begin="3" end="0" resetval="0x0" description=" Host Interrupt Map for Channel 4" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_HINT_MAP_REG2" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_HINT_MAP_REG2" offset="2056" width="32" description="">
		<bitfield id="HINT_MAP_9" width="4" begin="11" end="8" resetval="0x0" description=" Host Interrupt Map for Channel 9" range="11:8" rwaccess="R/W"/>
	<bitfield id="HINT_MAP_8" width="4" begin="3" end="0" resetval="0x0" description=" Host Interrupt Map for Channel 8" range="3:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG0" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG0" offset="2304" width="32" description="">
		<bitfield id="NONE_HINT_0" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/>
	<bitfield id="PRI_HINT_0" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 0 Prioritized Interrupt" range="9:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG1" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG1" offset="2308" width="32" description="">
		<bitfield id="NONE_HINT_1" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/>
	<bitfield id="PRI_HINT_1" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 1 Prioritized Interrupt" range="9:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG2" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG2" offset="2312" width="32" description="">
		<bitfield id="NONE_HINT_2" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/>
	<bitfield id="PRI_HINT_2" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 2 Prioritized Interrupt" range="9:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG3" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG3" offset="2316" width="32" description="">
		<bitfield id="NONE_HINT_3" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/>
	<bitfield id="PRI_HINT_3" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 3 Prioritized Interrupt" range="9:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG4" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG4" offset="2320" width="32" description="">
		<bitfield id="NONE_HINT_4" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/>
	<bitfield id="PRI_HINT_4" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 4 Prioritized Interrupt" range="9:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG5" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG5" offset="2324" width="32" description="">
		<bitfield id="NONE_HINT_5" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/>
	<bitfield id="PRI_HINT_5" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 5 Prioritized Interrupt" range="9:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG6" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG6" offset="2328" width="32" description="">
		<bitfield id="NONE_HINT_6" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/>
	<bitfield id="PRI_HINT_6" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 6 Prioritized Interrupt" range="9:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG7" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG7" offset="2332" width="32" description="">
		<bitfield id="NONE_HINT_7" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/>
	<bitfield id="PRI_HINT_7" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 7 Prioritized Interrupt" range="9:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG8" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG8" offset="2336" width="32" description="">
		<bitfield id="NONE_HINT_8" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/>
	<bitfield id="PRI_HINT_8" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 8 Prioritized Interrupt" range="9:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG9" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_PRI_HINT_REG9" offset="2340" width="32" description="">
		<bitfield id="NONE_HINT_9" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/>
	<bitfield id="PRI_HINT_9" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 9 Prioritized Interrupt" range="9:0" rwaccess="R"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_POLARITY_REG0" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_POLARITY_REG0" offset="3328" width="32" description="">
		<bitfield id="POLARITY_31" width="1" begin="31" end="31" resetval="0x1" description=" Polarity for intr_in[31] 0=low" range="31" rwaccess="R/W"/>
	<bitfield id="POLARITY_30" width="1" begin="30" end="30" resetval="0x1" description=" Polarity for intr_in[30] 0=low" range="30" rwaccess="R/W"/>
	<bitfield id="POLARITY_29" width="1" begin="29" end="29" resetval="0x1" description=" Polarity for intr_in[29] 0=low" range="29" rwaccess="R/W"/>
	<bitfield id="POLARITY_28" width="1" begin="28" end="28" resetval="0x1" description=" Polarity for intr_in[28] 0=low" range="28" rwaccess="R/W"/>
	<bitfield id="POLARITY_27" width="1" begin="27" end="27" resetval="0x1" description=" Polarity for intr_in[27] 0=low" range="27" rwaccess="R/W"/>
	<bitfield id="POLARITY_26" width="1" begin="26" end="26" resetval="0x1" description=" Polarity for intr_in[26] 0=low" range="26" rwaccess="R/W"/>
	<bitfield id="POLARITY_25" width="1" begin="25" end="25" resetval="0x1" description=" Polarity for intr_in[25] 0=low" range="25" rwaccess="R/W"/>
	<bitfield id="POLARITY_24" width="1" begin="24" end="24" resetval="0x1" description=" Polarity for intr_in[24] 0=low" range="24" rwaccess="R/W"/>
	<bitfield id="POLARITY_23" width="1" begin="23" end="23" resetval="0x1" description=" Polarity for intr_in[23] 0=low" range="23" rwaccess="R/W"/>
	<bitfield id="POLARITY_22" width="1" begin="22" end="22" resetval="0x1" description=" Polarity for intr_in[22] 0=low" range="22" rwaccess="R/W"/>
	<bitfield id="POLARITY_21" width="1" begin="21" end="21" resetval="0x1" description=" Polarity for intr_in[21] 0=low" range="21" rwaccess="R/W"/>
	<bitfield id="POLARITY_20" width="1" begin="20" end="20" resetval="0x1" description=" Polarity for intr_in[20] 0=low" range="20" rwaccess="R/W"/>
	<bitfield id="POLARITY_19" width="1" begin="19" end="19" resetval="0x1" description=" Polarity for intr_in[19] 0=low" range="19" rwaccess="R/W"/>
	<bitfield id="POLARITY_18" width="1" begin="18" end="18" resetval="0x1" description=" Polarity for intr_in[18] 0=low" range="18" rwaccess="R/W"/>
	<bitfield id="POLARITY_17" width="1" begin="17" end="17" resetval="0x1" description=" Polarity for intr_in[17] 0=low" range="17" rwaccess="R/W"/>
	<bitfield id="POLARITY_16" width="1" begin="16" end="16" resetval="0x1" description=" Polarity for intr_in[16] 0=low" range="16" rwaccess="R/W"/>
	<bitfield id="POLARITY_15" width="1" begin="15" end="15" resetval="0x1" description=" Polarity for intr_in[15] 0=low" range="15" rwaccess="R/W"/>
	<bitfield id="POLARITY_14" width="1" begin="14" end="14" resetval="0x1" description=" Polarity for intr_in[14] 0=low" range="14" rwaccess="R/W"/>
	<bitfield id="POLARITY_13" width="1" begin="13" end="13" resetval="0x1" description=" Polarity for intr_in[13] 0=low" range="13" rwaccess="R/W"/>
	<bitfield id="POLARITY_12" width="1" begin="12" end="12" resetval="0x1" description=" Polarity for intr_in[12] 0=low" range="12" rwaccess="R/W"/>
	<bitfield id="POLARITY_11" width="1" begin="11" end="11" resetval="0x1" description=" Polarity for intr_in[11] 0=low" range="11" rwaccess="R/W"/>
	<bitfield id="POLARITY_10" width="1" begin="10" end="10" resetval="0x1" description=" Polarity for intr_in[10] 0=low" range="10" rwaccess="R/W"/>
	<bitfield id="POLARITY_9" width="1" begin="9" end="9" resetval="0x1" description=" Polarity for intr_in[9] 0=low" range="9" rwaccess="R/W"/>
	<bitfield id="POLARITY_8" width="1" begin="8" end="8" resetval="0x1" description=" Polarity for intr_in[8] 0=low" range="8" rwaccess="R/W"/>
	<bitfield id="POLARITY_7" width="1" begin="7" end="7" resetval="0x1" description=" Polarity for intr_in[7] 0=low" range="7" rwaccess="R/W"/>
	<bitfield id="POLARITY_6" width="1" begin="6" end="6" resetval="0x1" description=" Polarity for intr_in[6] 0=low" range="6" rwaccess="R/W"/>
	<bitfield id="POLARITY_5" width="1" begin="5" end="5" resetval="0x1" description=" Polarity for intr_in[5] 0=low" range="5" rwaccess="R/W"/>
	<bitfield id="POLARITY_4" width="1" begin="4" end="4" resetval="0x1" description=" Polarity for intr_in[4] 0=low" range="4" rwaccess="R/W"/>
	<bitfield id="POLARITY_3" width="1" begin="3" end="3" resetval="0x1" description=" Polarity for intr_in[3] 0=low" range="3" rwaccess="R/W"/>
	<bitfield id="POLARITY_2" width="1" begin="2" end="2" resetval="0x1" description=" Polarity for intr_in[2] 0=low" range="2" rwaccess="R/W"/>
	<bitfield id="POLARITY_1" width="1" begin="1" end="1" resetval="0x1" description=" Polarity for intr_in[1] 0=low" range="1" rwaccess="R/W"/>
	<bitfield id="POLARITY_0" width="1" begin="0" end="0" resetval="0x1" description=" Polarity for intr_in[0] 0=low" range="0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_ICSS_INTC_INTC_SLV_POLARITY_REG1" acronym="ICSSM_PR1_ICSS_INTC_INTC_SLV_POLARITY_REG1" offset="3332" width="32" description="">
		<bitfield id="POLARITY_63" width="1" begin="31" end="31" resetval="0x1" description=" Polarity for intr_in[63] 0=low" range="31" rwaccess="R/W"/>
	<bitfield id="POLARITY_62" width="1" begin="30" end="30" resetval="0x1" description=" Polarity for intr_in[62] 0=low" range="30" rwaccess="R/W"/>
	<bitfield id="POLARITY_61" width="1" begin="29" end="29" resetval="0x1" description=" Polarity for intr_in[61] 0=low" range="29" rwaccess="R/W"/>
	<bitfield id="POLARITY_60" width="1" begin="28" end="28" resetval="0x1" description=" Polarity for intr_in[60] 0=low" range="28" rwaccess="R/W"/>
	<bitfield id="POLARITY_59" width="1" begin="27" end="27" resetval="0x1" description=" Polarity for intr_in[59] 0=low" range="27" rwaccess="R/W"/>
	<bitfield id="POLARITY_58" width="1" begin="26" end="26" resetval="0x1" description=" Polarity for intr_in[58] 0=low" range="26" rwaccess="R/W"/>
	<bitfield id="POLARITY_57" width="1" begin="25" end="25" resetval="0x1" description=" Polarity for intr_in[57] 0=low" range="25" rwaccess="R/W"/>
	<bitfield id="POLARITY_56" width="1" begin="24" end="24" resetval="0x1" description=" Polarity for intr_in[56] 0=low" range="24" rwaccess="R/W"/>
	<bitfield id="POLARITY_55" width="1" begin="23" end="23" resetval="0x1" description=" Polarity for intr_in[55] 0=low" range="23" rwaccess="R/W"/>
	<bitfield id="POLARITY_54" width="1" begin="22" end="22" resetval="0x1" description=" Polarity for intr_in[54] 0=low" range="22" rwaccess="R/W"/>
	<bitfield id="POLARITY_53" width="1" begin="21" end="21" resetval="0x1" description=" Polarity for intr_in[53] 0=low" range="21" rwaccess="R/W"/>
	<bitfield id="POLARITY_52" width="1" begin="20" end="20" resetval="0x1" description=" Polarity for intr_in[52] 0=low" range="20" rwaccess="R/W"/>
	<bitfield id="POLARITY_51" width="1" begin="19" end="19" resetval="0x1" description=" Polarity for intr_in[51] 0=low" range="19" rwaccess="R/W"/>
	<bitfield id="POLARITY_50" width="1" begin="18" end="18" resetval="0x1" description=" Polarity for intr_in[50] 0=low" range="18" rwaccess="R/W"/>
	<bitfield id="POLARITY_49" width="1" begin="17" end="17" resetval="0x1" description=" Polarity for intr_in[49] 0=low" range="17" rwaccess="R/W"/>
	<bitfield id="POLARITY_48" width="1" begin="16" end="16" resetval="0x1" description=" Polarity for intr_in[48] 0=low" range="16" rwaccess="R/W"/>
	<bitfield id="POLARITY_47" width="1" begin="15" end="15" resetval="0x1" description=" Polarity for intr_in[47] 0=low" range="15" rwaccess="R/W"/>
	<bitfield id="POLARITY_46" width="1" begin="14" end="14" resetval="0x1" description=" Polarity for intr_in[46] 0=low" range="14" rwaccess="R/W"/>
	<bitfield id="POLARITY_45" width="1" begin="13" end="13" resetval="0x1" description=" Polarity for intr_in[45] 0=low" range="13" rwaccess="R/W"/>
	<bitfield id="POLARITY_44" width="1" begin="12" end="12" resetval="0x1" description=" Polarity for intr_in[44] 0=low" range="12" rwaccess="R/W"/>
	<bitfield id="POLARITY_43" width="1" begin="11" end="11" resetval="0x1" description=" Polarity for intr_in[43] 0=low" range="11" rwaccess="R/W"/>
